@extends('Home.master')

@section('content')
    <!-- Jumbotron Header -->
    <header class="jumbotron hero-spacer">

    </header>
    <hr>
    <h2 style="color:blue ">به وب سایت وب لرن خوش آمدید</h2>
    <p>
       با سلام من هاجر صادقی ام. مدت زمانی هست که تو حوزه ی طراحی و برنامه نویسی وب سایت فعالیت می کنم. آدرس من استان فارس شهرستان گله داره و اگه سوالی داشتی می تونی برای من تو واتساپ پیام بدی(09389376395)  یا اینکه تو قسمت نظرات مربوط به هر دوره سوالاتتو بپرسی.ممنوونم ازاینکه وب لرنو انتخاب کردی.
    </p>


@endsection
