@extends('Home.master')

@section('content')
    <!-- Jumbotron Header -->
    <header class="jumbotron hero-spacer">
        <h2 style="color:blue ">به وب سایت وب لرن خوش آمدید</h2>
        <p>
            اگه عاشق طراحی و برنامه نویسی وب سایت هستی جای خوبی اومدی.
            . اینجا شما به یک متخصص وب سایت تبدیل می شی . پشتیبانی و سوالاتت خیلی راحت پاسخ داده می شه. ممنوونم که وب لرنو
            انتخاب
            کردی.
        </p>
        <p>
        <h3 style="color: #ff6600">

            قدم هایی که باید برای ساختن وب سایت انجام بدیم:
        </h3>
        <h4 style="color: blue">یادگیری HTML:</h4>
        درواقع یادگیری این مهارت بایه و اساس یادگیری و فعالیت در حوزه وب سایت هستش اگه بخوام این مسیله رو با ی مثال براتون
        توضیح بدم مثل این می مونه که شما بخواهید ی ساختمانی رو بنا کنید اولین چیزی که احتیاج بیدا می کنید این هست که
        ساختمونتون یک فونداسیون یا شالوده داشته باشه و ساختمون شما ی سری مصالح از جمله آهن و سنگ و گچ و آجر لازم داره ولی
        هیچ کس توی همچین ساختمومی زندگی نمی کنه طبیعتا چون این ساختمون در واقع نییمه کاره هست و نیاز به برق و اب و رنگ
        کابینت و خیلی امکانات دیگه بیدا می کنه.ولی نکته ایی که هست اینه که هیچ ساختمونی هم بدون این مصالح کامل نیست و در
        واقع بایه و اساس ساختن وب سایت اینه که حتما این مهارت رو یادش بگیریم.
        <h4 style="color: blue"> (توضیحات علمی تر) یادگیری HTML :</h4>

        HTML یا HyperText Markup Language یک زبان نشانه‌گذاری است که برای ساختاردهی و ایجاد صفحات وب استفاده می‌شود. با
        استفاده از HTML، می توانید متن، تصاویر، ویدئو، صوت، فرم ها و دیگر المان‌ها را در صفحات وب خود قرار دهید و آنها را به
        یکدیگر پیوند دهید.
        HTML شامل عناصر، تگ‌ها و ویژگی‌ها می‌باشد که همگی برای تشریح ساختار و محتوای صفحات وب استفاده می شوند. برای نمونه،
        با استفاده از تگ هایی مانند <p>، می توانید یک پاراگراف را در صفحه وب خود نشان دهید و با استفاده از تگ هایی مانند
            imgو video، می توانید تصاویر و ویدئوها را به صفحات وب خود اضافه کنید.
            HTML یکی از اصلی‌ترین زبان‌های مورد استفاده در توسعه وب است و بسیاری از وب سایت های امروزی از آن استفاده می
            کنند. با یادگیری HTML، می‌توانید صفحات وب پویا و جذابی را بدون نیاز به دانش برنامه‌نویسی پیاده‌سازی کنید.
            HTML یا HyperText Markup Language یک زبان نشانه‌گذاری است که برای ساختاردهی و ایجاد صفحات وب استفاده می‌شود. با
            استفاده از HTML، می توانید متن، تصاویر، ویدئو، صوت، فرم ها و دیگر المان‌ها را در صفحات وب خود قرار دهید و آنها
            را به یکدیگر پیوند دهید.
            HTML شامل عناصر، تگ‌ها و ویژگی‌ها می‌باشد که همگی برای تشریح ساختار و محتوای صفحات وب استفاده می شوند. برای
            نمونه، با استفاده از تگ هایی مانند p، می توانید یک پاراگراف را در صفحه وب خود نشان دهید و با استفاده از تگ هایی
            مانند img و video، می توانید تصاویر و ویدئوها را به صفحات وب خود اضافه کنید.
            HTML یکی از اصلی‌ترین زبان‌های مورد استفاده در توسعه وب است و بسیاری از وب سایت های امروزی از آن استفاده می
            کنند. با یادگیری HTML، می‌توانید صفحات وب پویا و جذابی را بدون نیاز به دانش برنامه‌نویسی پیاده‌سازی کنید.

        <h4 style="color: blue"> یادگیری CSS:</h4>
        قدم بعدی  آموزش این مهارت هست که در واقع با این مهارت شما اسکلت خوننتون رو زیبا می کنید مثلا ی
        گچکاری رنگ وغیره مثلا رنگ نوشته های سایت رو میتونید تغییر بدین برای نوشته ها و تصاویرتو نانیمیشن
        بسازید ی سری باهای زیبا برای دکمه ها و بس زمینه و خیلی امکانات که طراحی سایت شما رو کامل می کنه تا
        اینجا اومدی العان اگه این دو مهارتو خوب خوب یاد بگیری ی طراح حرفه ای شدی



        تا العان تو حوزه ی فرانت کار کردی یعنی همش کارای ظاهر سایت رو انجام دادی بس بهت می کن فرانت اند کار


        <h4 style="color: blue">یادگیری js:</h4>
        جاوا اسکریپت یک زبان برنامه‌نویسی است که برای توسعه وب‌سایت‌ها و برنامه‌های کاربردی وب استفاده
        می‌شود. این زبان نسخه ساده‌شده‌ای از زبان برنامه‌نویسی جاوا است و در سال ۱۹۹۵ توسط شرکت (Netscape)
        نت‌اسکیپ بداع شد.

        جاوا اسکریپت قابلیت اجرا در محیط‌های مختلفی از جمله مرورگرهای وب دارد و می‌تواند بدون نیاز به نصب
        برنامه و به صورت کاملاً پویا و تعاملی، صفحات وب را بهبود بخشد. از کاربردهای اصلی جاوا اسکریپت
        می‌توان به ایجاد افکت‌های تصویری، اعتبارسنجی فرم‌ها، تعامل با کاربر، استفاده از نمودارها و
        نمایشگرهای دیگر و همچنین توسعه برنامه‌های کاربردی وب اشاره کرد.

        از زبان‌های برنامه‌نویسی دیگری که ممکن است با جاوا اسکریپت مقایسه شود (PHP، Ruby،
        Python)است.ومی‌توان Node.js اشاره کرد. با این حال، به دلیل موفقیت و پراستفاده بودن در حوزه توسعه وب،
        جاوا اسکریپت به یکی از مهمترین زبان‌های برنامه‌نویسی تبدیل شده است.




        </p>
    </header>
    <hr>
    <div class="row">
        <div class="col-lg-12">
            <h3>آخرین دوره ها</h3>
        </div>
    </div>
    <div class="row ">
        @foreach ($courses as $course)
            <div class="col-md-3 col-sm-6 hero-feature">
                <div class="thumbnail">
                    <img src="{{ $course->images['thumb'] }}" alt="">
                    <div class="caption">
                        <h3><a href="{{ $course->path() }}">{{ $course->title }}</a></h3>


                        <p> {{ Str::limit($course->description, 40) }}
                        <p>
                        <p>
                            <a href="{{ $course->path() }}" class="btn btn-primary">خرید</a> <a href="{{ $course->path() }}"
                                class="btn btn-default">اطلاعات بیشتر</a>
                        </p>
                    </div>
                    <div class="ratings">
                        <p class="pull-left">{{ $course->viewCount }} بازدید</p>
                        {{--                    <p class="pull-left">{{  Redis::get("views.{$course->id}.courses") }} بازدید</p> --}}

                    </div>
                </div>
            </div>
        @endforeach
    </div>
    <hr>

    <div class="col-md-12">
        <div class="row">
            <div class="col-sm-12">
                <h3>مقالات</h3>
            </div>
            @foreach ($articles as $article)
                <div class="col-sm-4 col-lg-4 col-md-4">
                    <div class="thumbnail">
                        <img src="{{ $article->images['thumb'] }}" alt="">
                        <div class="caption">
                            <h3><a href="{{ $article->path() }}">{{ $article->title }}</a></h3>
                            <p> {{ Str::limit($article->description, 40) }}
                            <p>
                        </div>
                        <div class="ratings">
                            <p class="pull-right">{{ $article->viewCount }} بازدید</p>
                            {{-- <p class="pull-left">{{ Redis::get("views.{$article->id}.article") }} بازدید</p> --}}

                        </div>
                    </div>
                </div>
            @endforeach

        </div>
    </div>
@endsection
